-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-07-12 12:07:19
-- 伺服器版本： 10.4.24-MariaDB
-- PHP 版本： 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `functionpop`
--

-- --------------------------------------------------------

--
-- 資料表結構 `products`
--

CREATE TABLE `products` (
  `product_id` int(11) NOT NULL,
  `product_name` varchar(100) NOT NULL,
  `product_category` varchar(100) NOT NULL,
  `product_gender` varchar(100) NOT NULL,
  `product_description` varchar(255) NOT NULL,
  `product_composition` varchar(255) NOT NULL,
  `product_image` varchar(255) NOT NULL,
  `product_image2` varchar(255) NOT NULL,
  `product_image3` varchar(255) NOT NULL,
  `product_image4` varchar(255) NOT NULL,
  `product_price` decimal(6,0) DEFAULT NULL,
  `product_special_offer` int(2) DEFAULT NULL,
  `product_code` varchar(255) NOT NULL,
  `product_update` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `product_upload` timestamp NOT NULL DEFAULT current_timestamp(),
  `product_rating` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 傾印資料表的資料 `products`
--

INSERT INTO `products` (`product_id`, `product_name`, `product_category`, `product_gender`, `product_description`, `product_composition`, `product_image`, `product_image2`, `product_image3`, `product_image4`, `product_price`, `product_special_offer`, `product_code`, `product_update`, `product_upload`, `product_rating`) VALUES
(1, '休閒剪裁棉質T恤', '上衣', 'Male', 'T恤，柔軟棉質平紋布料，休閒剪裁。細羅紋圓領，垂肩設計，直身下襬。', '棉 100%', 'FP1_80100001_beige_0.jpg', 'FP1_80100001_turquoise_0.jpg', 'FP1_80100001_beige_1.webp', 'FP1_80100001_turquoise_1.webp', '499', NULL, 'FP1_80100001', '2022-06-28 18:13:31', '2022-06-11 19:18:39', '4.21'),
(2, '標準剪裁T恤', '上衣', 'Male', '圓領T恤，柔軟粗紡棉質平紋布料，有開口式單胸袋。', '棉 100%', 'FP1_80100002_black_0.jpg', 'FP1_80100002_lightblue_0.jpg', 'FP1_80100002_turquoise_0.jpg', 'FP1_80100002_white_0.jpg', '349', NULL, 'FP1_80100002', '2022-06-28 17:57:55', '2022-06-11 19:18:39', '3.92'),
(3, '加大碼棉質T恤', '上衣', 'Male', '加大碼T恤，棉質平紋布料，羅紋圓領，垂肩設計。', '棉 100%', 'FP1_80100003_lightgreen_0.jpg', 'FP1_80100003_lightgreen_1.jpg', 'FP1_80100003_white_0.jpg', 'FP1_80100003_white_1.jpg', '499', NULL, 'FP1_80100003', '2022-06-28 17:58:01', '2022-06-11 19:18:39', '4.44'),
(4, '休閒剪裁圖案T恤', '上衣', 'Male', '圖案T恤，柔軟棉質平紋布料，休閒剪裁。羅紋圓領，垂肩設計，直身下襬。', '棉 100%', 'FP1_80100004_lightblue_0.jpg', 'FP1_80100004_lightblue_1.webp', 'FP1_80100004_lightblue_2.webp', 'FP1_80100004_lightblue_3.webp', '699', NULL, 'FP1_80100004', '2022-06-28 17:58:05', '2022-06-11 19:18:39', '4.70'),
(5, '休閒剪裁圖案T恤', '上衣', 'Male', '圖案T恤，柔軟棉質平紋布料，休閒剪裁。羅紋圓領，垂肩設計，直身下襬。', '棉 100%', 'FP1_80100005_white_0.jpg', 'FP1_80100005_white_1.jpg', 'FP1_80100005_white_2.jpg', 'FP1_80100005_white_3.jpg', '699', NULL, 'FP1_80100005', '2022-06-28 17:58:23', '2022-06-11 19:26:34', '4.51'),
(6, '剪裁棉質T恤', '上衣', 'Male', '柔軟棉質平紋T恤，休閒剪裁，印有圖案。羅紋圓領，垂肩設計，直身下襬。', '棉 100%', 'FP1_80100006_blue_0.jpg', 'FP1_80100006_blue_1.jpg', 'FP1_80100006_blue_2.jpg', 'FP1_80100006_blue_3.jpg', '349', NULL, 'FP1_80100006', '2022-07-12 02:22:31', '2022-06-11 19:33:39', '4.48'),
(7, '棉質Polo衫', '上衣', 'Male', '棉質網眼Polo衫，羅紋衣領，鈕扣半開襟，短袖有羅紋袖口，兩側開衩。', '棉 100%', 'FP1_80100007_black_0.jpg', 'FP1_80100007_black_1.jpg', 'FP1_80100007_black_2.jpg', 'FP1_80100007_black_3.jpg', '349', NULL, 'FP1_80100007', '2022-06-28 17:58:35', '2022-06-11 21:46:51', '3.92'),
(8, '休閒剪裁圖案T恤', '上衣', 'Male', '圖案T恤，柔軟棉質平紋布料。休閒剪裁。', '棉 100%', 'FP1_80100008_lightpink_0.jpg', 'FP1_80100008_lightpink_1.jpg', 'FP1_80100008_lightpink_2.jpg', 'FP1_80100008_lightpink_3.jpg', '699', NULL, 'FP1_80100008', '2022-06-28 17:58:40', '2022-06-11 21:52:37', '3.63'),
(9, '健美合身剪裁網眼Polo衫', '上衣', 'Male', '健美合身剪裁網眼Polo衫', '棉 97%, 彈性纖維 3%', 'FP1_80100009_turquoise_0.jpg', 'FP1_80100009_turquoise_1.jpg', 'FP1_80100009_turquoise_2.jpg', 'FP1_80100009_turquoise_3.jpg', '499', NULL, 'FP1_80100009', '2022-06-28 17:58:43', '2022-06-11 22:36:42', '3.33'),
(10, '加大碼橄欖球衫', '上衣', 'Male', '加大碼有領橄欖球衫，柔軟棉質平紋布料，隱形鈕扣半開襟，垂肩長袖有羅紋袖口，下襬兩側開衩。', '<br>外層: 棉 100%\r\n<br>衣領: 棉 100%', 'FP1_80100010_darkgreen_0.jpg', 'FP1_80100010_darkgreen_1.jpg', 'FP1_80100010_darkgreen_2.jpg', 'FP1_80100010_darkgreen_3.jpg', '699', NULL, 'FP1_80100010', '2022-06-28 17:58:47', '2022-06-11 23:32:02', '2.99'),
(11, '緊身西裝褲', '下著', 'Male', '彈性平織西裝褲，拉鍊門襟配隱形鉤扣，有側袋和嵌線後袋，褲管有褶線。緊身剪裁 ─ 褲管略短，大腿、膝蓋及腳踝部位貼身剪裁，打造完美合身線條。', '<br>\r\n外層: 聚酯纖維 67%, 嫘縈 32%, 彈性纖維 1% <br>\r\n口袋內裡: 聚酯纖維 80%, 棉 20%', 'FP1_80200001_darkblue_0.jpg', 'FP1_80200001_darkblue_1.jpg', 'FP1_80200001_darkblue_2.jpg', 'FP1_80200001_darkblue_3.jpg', '1299', NULL, 'FP1_80200001', '2022-06-28 18:00:02', '2022-06-11 23:55:13', '4.02'),
(12, '休閒剪裁工作褲', '下著', 'Male', '棉質平織長褲，中腰休閒剪裁，覆面鬆緊帶腰圍配抽繩，有斜側袋，後袋和褲管袋皆有魔鬼粘式翻蓋，另有一個拉鍊式隱形褲管袋。膝部有接縫設計，褲腳有彈性抽繩。', '<br>口袋內裡: 棉 100%\r\n<br>外層: 棉 97%, 彈性纖維 3%', 'FP1_80200002_beige_0.jpg', 'FP1_80200002_beige_1.jpg', 'FP1_80200002_beige_2.jpg', 'FP1_80200002_beige_3.jpg', '1299', 0, 'FP1_80200002', '2022-06-28 18:00:06', '2022-06-12 00:03:44', '3.87'),
(13, '合身亞麻混紡長褲', '下著', 'Male', '透氣棉麻平織長褲，中腰合身剪裁，覆面鬆緊帶腰圍配抽繩，拉鍊門襟配鉤扣，有側袋和一個嵌線後袋。', '<br>外層: 亞麻 54%, 棉 46%\r\n<br>口袋內裡: 聚酯纖維 65%, 棉 35%', 'FP1_80200003_darkbeige_0.jpg', 'FP1_80200003_darkbeige_1.jpg', 'FP1_80200003_darkbeige_2.jpg', 'FP1_80200003_darkbeige_3.jpg', '999', 0, 'FP1_80200003', '2022-06-28 18:00:09', '2022-06-12 00:34:58', '4.67'),
(14, '貼身西裝褲', '下著', 'Male', '九分西裝褲，平織布料，拉鍊門襟配隱形鉤扣，有側袋和嵌線後袋，褲管有褶線。大腿、膝蓋及腳踝部位貼身剪裁，打造合身線條。', '<br>外層: 聚酯纖維 67%, 嫘縈 31%, 彈性纖維 2%\r\n<br>口袋內裡: 聚酯纖維 91%, 棉 9%', 'FP1_80200004_bluemelange_0.jpg', 'FP1_80200004_bluemelange_1.jpg', 'FP1_80200004_bluemelange_2.jpg', 'FP1_80200004_bluemelange_3.jpg', '1299', 0, 'FP1_80200004', '2022-06-28 18:00:16', '2022-06-12 00:41:16', '3.48'),
(15, '合身亞麻混紡慢跑褲', '下著', 'Male', '棉麻平織慢跑褲，覆面鬆緊帶腰圍配抽繩，有斜側袋和嵌線後袋，褲腳有覆面鬆緊帶。合身剪裁－經典剪裁提供大腿和膝部充足的空間方便活動，打造舒適直筒線條。', '亞麻 55%, 棉 45%\r\n<br>口袋: 棉 100%', 'FP1_80200005_khakigreen_0.jpg', 'FP1_80200005_khakigreen_1.jpg', 'FP1_80200005_khakigreen_2.jpg', '', '699', 0, 'FP1_80200005', '2022-06-28 18:00:24', '2022-06-12 00:52:15', '4.11'),
(16, '合身慢跑褲', '下著', 'Male', '棉混紡面料運動褲。 帶邊鬆緊帶和束帶的腰帶。 側縫口袋，羅紋下擺，內部柔軟拉絨。', '棉 60%, 聚酯纖維 40%', 'FP1_80200006_steelgray_0.jpg', 'FP1_80200006_steelgray_1.jpg', 'FP1_80200006_steelgray_2.jpg', 'FP1_80200006_steelgray_3.jpg', '599', 0, 'FP1_80200006', '2022-07-09 18:33:32', '2022-06-12 01:00:55', '4.07'),
(17, '跑步長褲', '下著', 'Male', '跑步長褲，快乾機能布料，讓運動時能保持乾爽。鬆緊帶腰圍配隱形抽繩，拉鍊式側袋有網布內裡，褲管收窄，褲腳配拉鍊，帶反光細節。', '聚酯纖維 86%, 彈性纖維 14%', 'FP1_80200007_sagegreen_0.jpg', 'FP1_80200007_sagegreen_1.jpg', 'FP1_80200007_sagegreen_2.jpg', 'FP1_80200007_sagegreen_3.jpg', '999', 0, 'FP1_80200007', '2022-06-28 18:00:32', '2022-06-12 01:05:45', '4.19'),
(18, '合身九分慢跑褲', '下著', 'Male', '九分慢跑褲，柔軟棉質斜紋布料，覆面鬆緊帶腰圍配隱形抽繩，拉鍊門襟配鈕扣，有斜側袋和鈕扣式嵌線後袋。合身剪裁－經典剪裁提供大腿和膝部充足的空間方便活動，打造舒適直筒線條。', '<br>口袋內裡: 聚酯纖維 65%, 棉 35%\r\n<br>外層: 棉 98%, 彈性纖維 2%', 'FP1_80200008_black_0.jpg', 'FP1_80200008_black_1.jpg', 'FP1_80200008_black_2.jpg', 'FP1_80200008_black_3.jpg', '799', 0, 'FP1_80200008', '2022-06-28 18:00:41', '2022-06-12 03:19:47', '4.22'),
(19, '貼身九分褲', '下著', 'Male', '九分褲，平織布料，腰部有隱形鉤扣和鈕扣，拉鍊門襟，有側袋和鈕扣式嵌線後袋，褲管有褶線。大腿和膝部貼身剪裁，打造合身線條。', '聚酯纖維 83%, 嫘縈 15%, 彈性纖維 2%', 'FP1_80200009_lightgray_0.jpg', 'FP1_80200009_lightgray_1.jpg', 'FP1_80200009_lightgray_2.jpg', 'FP1_80200009_lightgray_3.jpg', '699', 0, 'FP1_80200009', '2022-06-28 18:00:53', '2022-06-12 03:24:13', '4.23'),
(20, '防潑水卡其褲', '下著', 'Male', '卡其褲，防潑水尼龍布料，能防小雨。四面彈性機能，可提供極佳舒適感並增加靈活度。拉鍊門襟配按扣，有側袋、一個手機口袋和一個隱形拉鍊式後袋。腰部正面有小掛圈，可掛鑰匙圈。', '<br>口袋內裡: 聚酯纖維 80%, 棉 20%\r\n<br>外層: 聚醯胺纖維 88%, 彈性纖維 12%', 'FP1_80200010_black_0.jpg', 'FP1_80200010_black_1.jpg', 'FP1_80200010_black_2.jpg', 'FP1_80200010_black_3.jpg', '1499', 0, 'FP1_80200010', '2022-06-28 18:00:58', '2022-06-12 03:28:31', '4.21'),
(21, '德比鞋', '鞋', 'Male', '柔軟仿麂皮德比鞋，開放式鞋翼。棉質帆布內裡和內底，花紋鞋底。跟高2公分。', '<br>鞋底: 熱塑性橡膠 100%\r\n<br>鞋幫: 聚酯纖維 100%\r\n<br>內裡: 棉 100%', 'FP1_80300001_black_0.jpg', 'FP1_80300001_black_1.jpg', 'FP1_80300001_black_2.jpg', 'FP1_80300001_black_3.jpg', '1299', NULL, 'FP1_80300001', '2022-06-28 18:13:34', '2022-06-12 03:35:59', '3.28'),
(22, '戲水鞋\r\n', '鞋', 'Male', '戲水鞋，鞋面有寬飾帶，壓模內底。花紋鞋底，高4.5公分。', '<br>內裡: 乙烯-醋酸乙烯酯共聚物 100%\r\n<br>鞋幫: 乙烯-醋酸乙烯酯共聚物 100%\r\n<br>鞋底: 乙烯-醋酸乙烯酯共聚物 100%', 'FP1_80300002_black_0.jpg', 'FP1_80300002_black_1.jpg', 'FP1_80300002_black_2.jpg', '', '699', 0, 'FP1_80300002', '2022-06-28 18:01:37', '2022-06-12 03:40:31', '3.79'),
(23, '懶人鞋', '鞋', 'Male', '平織布料運動鞋，網布鞋面，兩側鑲鬆緊帶，有後跟拉環。軟木內底；花紋橡膠鞋底，高2公分。', '<br>鞋幫: 聚酯纖維 100%\r\n<br>鞋底: 橡膠 100%\r\n<br>內裡: 棉 100%', 'FP1_80300003_darkblue_0.jpg', 'FP1_80300003_darkblue_1.jpg', 'FP1_80300003_darkblue_2.jpg', 'FP1_80300003_darkblue_3.jpg', '699', 0, 'FP1_80300003', '2022-06-28 18:01:40', '2022-06-12 04:21:25', '3.98'),
(24, '高筒帆布鞋', '鞋', 'Male', '運動鞋。 厚棉帆布高幫，正面有鞋舌和繫帶。 一側有金屬扣眼。 棉帆布襯里和鞋墊。 圖案橡膠鞋底。', '<br>鞋底: 橡膠 100%\r\n<br>鞋幫: 棉 100%\r\n<br>內裡: 棉 100%', 'FP1_80300004_blue_0.jpg', 'FP1_80300004_blue_1.jpg', 'FP1_80300004_blue_2.jpg', 'FP1_80300004_blue_3.jpg', '799', 0, 'FP1_80300004', '2022-07-09 18:32:32', '2022-06-12 04:35:41', '4.28'),
(25, '帆布運動鞋', '鞋', 'Male', '仿皮人字拖，鞋面有車棉飾帶，壓模內底。花紋鞋底，高2公分。', '<br>內裡: 棉 100%\r\n<br>鞋底: 橡膠 100%\r\n<br>鞋幫: 棉 100%', 'FP1_80300005_turquoise_0.jpg', 'FP1_80300005_turquoise_1.jpg', 'FP1_80300005_turquoise_2.jpg', 'FP1_80300005_turquoise_3.jpg', '699', 0, 'FP1_80300005', '2022-06-28 18:01:54', '2022-06-12 04:53:09', '4.42'),
(26, '可收納多功能包', '包', 'Male', '多功能包，抗撕裂布料，可作為後背包和手提包。上部有雙提把，包口有拉鍊，可調式薄鋪棉背帶有扣鎖，背面口袋可隱藏背帶。正面有一個拉鍊式夾層，兩側有開放式網布夾層。有一個拉鍊式內夾層，包包可輕鬆折疊並收納於此夾層，收納完成時有實用背帶。有內裡。深約8公分，寬約34公分，高約35公分。', '<br>外層: 聚酯纖維 100%\r\n<br>內裡: 聚酯纖維 100%\r\n<br>內襯: 聚乙烯纖維 100%', 'FP1_80400001_black_0.jpg', 'FP1_80400001_black_1.jpg', 'FP1_80400001_black_2.jpg', 'FP1_80400001_black_3.jpg', '999', 0, 'FP1_80400001', '2022-06-28 18:02:53', '2022-06-12 05:55:32', '3.96'),
(27, '度假包', '包', 'Male', '平織布料度假包，上部有雙提把，包口有雙頭拉鍊，可調式背帶可拆。短側有可調式扣帶，可調整包包大小。有一個拉鍊式外格和一個拉鍊式內夾層。有內裡。深22公分，寬48公分，高39公分。', '<br>外層: 聚酯纖維 100%\r\n<br>內裡: 聚酯纖維 100%', 'FP1_80400002_black_0.jpg', 'FP1_80400002_black_1.jpg', 'FP1_80400002_black_2.jpg', 'FP1_80400002_black_3.jpg', '799', 0, 'FP1_80400002', '2022-06-28 18:02:56', '2022-06-15 04:43:16', '3.92'),
(28, '腰包', '包', 'Male', '腰包，耐用平織布料，正面有一個不對稱網布夾層，背面有一個拉鍊式網布夾層。包口有雙頭拉鍊，可調式腰帶配塑膠扣鎖。有內裡。深7.5公分，高16公分，寬36公分。', '<br>內裡: 聚酯纖維 100%\r\n<br>外層: 聚酯纖維 100%', 'FP1_80400003_lightpurple_0.jpg', 'FP1_80400003_lightpurple_1.jpg', 'FP1_80400003_lightpurple_2.jpg', 'FP1_80400003_lightpurple_3.jpg', '699', 0, 'FP1_80400003', '2022-06-28 18:02:59', '2022-06-15 04:46:10', '4.03'),
(29, '卷口式後背包', '包', 'Male', '平織布料後背包，上部有單提把，卷式包口有拉鍊和可調式塑膠扣扣帶。可調式鋪棉背帶，兩側皆有夾層和可調式塑膠扣扣帶。背面有拉鍊式鋪棉筆電夾層，有一個拉鍊式網布小內夾層。鋪棉底墊。有內裡。包底寬約26公分，包口收卷後高約44公分。', '<br>外層: 聚酯纖維 100%\r\n<br>內襯: 聚乙烯纖維 100%\r\n<br>內裡: 聚酯纖維 100%', 'FP1_80400004_black_0.jpg', 'FP1_80400004_black_1.jpg', 'FP1_80400004_black_2.jpg', 'FP1_80400004_black_3.jpg', '999', 0, 'FP1_80400004', '2022-06-28 18:03:03', '2022-06-15 17:44:41', '4.08'),
(30, '小肩包', '包', 'Male', '小肩包，平織布料，包口有拉鍊，可調式背帶可拆。正面有一個拉鍊式外格，背面有一個開口式小外格，有一個內夾層。有內裡。深2.5公分，寬11公分，高17.5公分。', '<br>外層: 聚酯纖維 100%\r\n<br>內裡: 聚酯纖維 100%', 'FP1_80400005_black_0.jpg', 'FP1_80400005_black_1.jpg', 'FP1_80400005_black_2.jpg', 'FP1_80400005_black_3.jpg', '399', 0, 'FP1_80400005_black', '2022-06-28 18:03:06', '2022-06-15 17:50:19', '3.61'),
(31, '羅紋T恤', '上衣', 'Female', '長版T恤，柔軟棉質混紡羅紋平紋布料，圓領有飾邊，垂肩設計，不收邊直身下襬，兩側開衩。', '棉 62%, 聚酯纖維 33%, 彈性纖維 5%', 'FP2_80100001_cream_0.jpg', 'FP2_80100001_cream_1.jpg', 'FP2_80100001_cream_2.jpg', 'FP2_80100001_cream_3.jpg', '699', 0, 'FP2_80100001', '2022-06-15 19:41:06', '2022-06-15 17:56:08', '3.93'),
(32, '莫代爾混紡T恤', '上衣', 'Female', '莫代爾和棉混紡柔軟竹節平紋針織T恤。寬領口和圓形下擺。', '棉 50%, 莫代爾纖維 50%', 'FP2_80100002_lightbluemelange_0.jpg', 'FP2_80100002_lightbluemelange_1.jpg', 'FP2_80100002_lightbluemelange_2.jpg', 'FP2_80100002_lightbluemelange_3.jpg', '349', 0, 'FP2_80100002', '2022-06-15 19:40:50', '2022-06-15 18:49:42', '4.88'),
(33, '亞麻混紡女衫', '上衣', 'Female', '透氣梭織亞麻棉混紡襯衫。 圓領，V 形開口，頂部有窄繫帶，泡泡袖，袖口和下擺有邊鬆緊帶。 無襯裡。', '亞麻 55%, 棉 45%', 'FP2_80100003_white_0.jpg', 'FP2_80100003_white_1.jpg', 'FP2_80100003_white_2.jpg', 'FP2_80100003_white_3.jpg', '699', 0, 'FP2_80100003', '2022-07-10 05:20:24', '2022-06-15 19:11:51', '4.80'),
(34, '加大碼圖案T恤', '上衣', 'Female', '加大碼圖案T恤，棉質平紋布料，寬鬆垂肩五分袖。', '棉 100%', 'FP2_80100004_pink_0.jpg', 'FP2_80100004_pink_1.jpg', 'FP2_80100004_pink_2.jpg', 'FP2_80100004_pink_3.jpg', '499', 0, 'FP2_80100004', '2022-06-15 19:41:49', '2022-06-15 19:33:30', '3.75'),
(35, '短版T恤', '上衣', 'Female', '短版T恤，柔軟平紋布料，方形剪裁，羅紋圓領，垂肩寬鬆衣袖。', '棉 100%', 'FP2_80100005_lightyellow_0.jpg', 'FP2_80100005_lightyellow_1.jpg', 'FP2_80100005_lightyellow_2.jpg', 'FP2_80100005_lightyellow_3.jpg', '149', 0, 'FP2_80100005', '2022-06-15 19:48:43', '2022-06-15 19:48:43', '4.20'),
(36, '莫代爾混紡洋裝', '洋裝', 'Female', '圓領中長版洋裝，柔軟莫代爾纖維和棉質混紡平紋布料，長袖款式，兩側開衩。', '莫代爾纖維 52%, 棉 48%', 'FP2_80100006_khakigreen_0.jpg', 'FP2_80100006_khakigreen_1.jpg', 'FP2_80100006_khakigreen_2.jpg', 'FP2_80100006_khakigreen_3.jpg', '699', 0, 'FP2_80100006', '2022-06-28 18:11:17', '2022-06-15 19:58:02', '3.29'),
(37, '萊賽爾混紡羅紋洋裝', '洋裝', 'Female', '羅紋精織中長版洋裝，萊賽爾混紡布料，合身剪裁，方領，細肩帶，兩側開衩。', '萊賽爾 77%, 聚醯胺纖維 23%', 'FP2_80100007_beige_0.jpg', 'FP2_80100007_beige_1.jpg', 'FP2_80100007_beige_2.jpg', 'FP2_80100007_beige_3.jpg', '1999', 0, 'FP2_80100007', '2022-06-28 18:11:20', '2022-06-15 20:04:12', '3.3'),
(38, '棉質T恤洋裝', '洋裝', 'Female', 'T恤短洋裝，厚實棉質平紋布料，直身剪裁，羅紋圓領。無內裡。', '棉 100%', 'FP2_80100008_white_0.jpg', 'FP2_80100008_white_1.jpg', 'FP2_80100008_white_2.jpg', 'FP2_80100008_white_3.jpg', '499', 0, 'FP2_80100008', '2022-06-28 18:11:24', '2022-06-15 21:51:43', '4.17'),
(39, '加大碼圖案T恤洋裝', '洋裝', 'Female', '超大款短款連衣裙，柔軟針織面料，正面飾有印花圖案。 羅紋圓領、重度落肩和寬袖。', '棉 100%', 'FP2_80100009_blue_0.jpg', 'FP2_80100009_blue_1.jpg', 'FP2_80100009_blue_2.jpg', 'FP2_80100009_blue_3.jpg', '699', 0, 'FP2_80100009', '2022-06-28 18:11:28', '2022-06-15 22:09:52', '4.41'),
(40, '百褶洋裝', '洋裝', 'Female', '中長版百褶洋裝，平紋布料，細肩帶，前後開V領，正面縫固交疊式設計有裝飾綁帶。無內裡。', '外層: 再生聚酯纖維 100%', 'FP2_80100010_lightblue_0.jpg', 'FP2_80100010_lightblue_1.jpg', 'FP2_80100010_lightblue_2.jpg', 'FP2_80100010_lightblue_3.jpg', '999', 0, 'FP2_80100010', '2022-06-28 18:11:31', '2022-06-15 22:19:33', '4.3'),
(41, '交疊式洋裝', '洋裝', 'Female', '平紋中長版洋裝，略帶垂墜感，縫固交疊式V領設計，一側有細綁帶。蝴蝶袖帶柔軟垂墜感，微傘狀裙襬。', '<br>內裡: 聚酯纖維 100%\r\n<br>外層: 聚酯纖維 95%, 彈性纖維 5%', 'FP2_80100011_greige_0.jpg', 'FP2_80100011_greige_1.jpg', 'FP2_80100011_greige_2.jpg', 'FP2_80100011_greige_3.jpg', '799', 0, 'FP2_80100011', '2022-06-28 18:11:33', '2022-06-15 22:40:51', '4.72'),
(42, '綁帶襯衫式洋裝', '洋裝', 'Female', '有領襯衫式洋裝，棉質平織布料，正面隱形鈕扣開襟。低垂肩長袖，袖口配鈕扣。腰部有可拆式綁帶，圓邊裙襬。', '棉 100%', 'FP2_80100012_purple_0.jpg', 'FP2_80100012_purple_1.jpg', 'FP2_80100012_purple_2.jpg', 'FP2_80100012_purple_3.jpg', '799', 0, 'FP2_80100012', '2022-06-28 18:11:37', '2022-06-15 22:46:39', '4.15'),
(43, '連帽上衣', '上衣', 'Female', '汗衫布料寬鬆上衣，連衣帽有內裡和抽繩，有袋鼠袋，羅紋袖口和下襬。', '棉 60%, 聚酯纖維 40%', 'FP2_80100013_beige_0.jpg', 'FP2_80100013_beige_1.jpg', 'FP2_80100013_beige_2.jpg', 'FP2_80100013_beige_3.jpg', '699', 0, 'FP2_80100013', '2022-06-15 22:53:56', '2022-06-15 22:53:56', '4.87'),
(44, '百褶裙', '裙子', 'Female', '雪紡百褶中長裙，高腰剪裁，鬆緊帶腰圍。綢緞內裡。', '<br>外層: 聚酯纖維 96%, 彈性纖維 4%\r\n<br>內裡: 聚酯纖維 89%, 彈性纖維 11%', 'FP2_80200001_lightgrey_0.jpg', 'FP2_80200001_lightgrey_1.jpg', 'FP2_80200001_lightgrey_2.jpg', 'FP2_80200001_lightgrey_3.jpg', '999', 0, 'FP2_80200001', '2022-06-15 22:58:56', '2022-06-15 22:58:56', '4.69'),
(45, '紋理感平織裙', '裙子', 'Female', '高腰短裙，紋理感平織布料，貼身剪裁，一側有隱形拉鍊。有內裡。', '<br>內裡: 聚酯纖維 100%\r\n<br>外層: 聚酯纖維 82%, 棉 18%', 'FP2_80200002_beige_0.jpg', 'FP2_80200002_beige_1.jpg', 'FP2_80200002_beige_2.jpg', 'FP2_80200002_beige_3.jpg', '999', 0, 'FP2_80200002', '2022-06-15 23:03:47', '2022-06-15 23:03:47', '4.32'),
(46, '斜紋短裙', '裙子', 'Female', '百褶短裙，彈性斜紋布料，一側有單顆鈕扣和隱形拉鍊。無內裡。', '聚酯纖維 98%, 彈性纖維 2%', 'FP2_80200003_blue_0.jpg', 'FP2_80200003_blue_1.jpg', 'FP2_80200003_blue_2.jpg', 'FP2_80200003_blue_3.jpg', '699', 0, 'FP2_80200003', '2022-06-15 23:06:56', '2022-06-15 23:06:56', '3.99'),
(47, '及地長裙', '裙子', 'Female', '褶縐平織裙，長度及踝，高腰剪裁，覆面鬆緊帶腰圍。傘狀裙襬有抓皺縫線，可增加豐盈感和蓬度。', '嫘縈 72%, 聚醯胺纖維 28%', 'FP2_80200004_white_0.jpg', 'FP2_80200004_white_1.jpg', 'FP2_80200004_white_2.jpg', 'FP2_80200004_white_3.jpg', '1499', 0, 'FP2_80200004', '2022-06-15 23:10:11', '2022-06-15 23:10:11', '4.08'),
(48, '中長裙', '裙子', 'Female', '中長裙，平織布料，高腰休閒剪裁，覆面鬆緊帶腰圍配抽繩。有內裡。', '聚酯纖維 67%, 聚醯胺纖維 33%', 'FP2_80200005_white_0.jpg', 'FP2_80200005_white_1.jpg', 'FP2_80200005_white_2.jpg', 'FP2_80200005_white_3.jpg', '999', 0, 'FP2_80200005', '2022-06-15 23:32:04', '2022-06-15 23:31:18', '3.23'),
(49, '懶人鞋', '鞋', 'Female', '棉質斜紋懶人鞋，兩側鑲鬆緊帶，有後跟拉環。棉質帆布內裡和內底，平滑鞋底下方有溝槽設計。', '<br>鞋幫: 棉 100%\r\n<br>內裡: 棉 100%\r\n<br>鞋底: 熱塑性橡膠 100%', 'FP2_80300001_beige_0.jpg', 'FP2_80300001_beige_1.jpg', 'FP2_80300001_beige_2.jpg', 'FP2_80300001_beige_3.jpg', '499', 0, 'FP2_80300001', '2022-06-16 00:20:06', '2022-06-15 23:40:39', '4.58'),
(50, '人字拖', '鞋', 'Female', '仿皮人字拖，細夾腳帶，鞋面有鋪棉寬飾帶。平紋內裡，仿皮內底。鞋底高1.5公分。', '<br>鞋底: 熱塑性橡膠 100%\r\n<br>內裡: 聚酯纖維 100%\r\n<br>鞋幫: 聚氨酯 100%', 'FP2_80300002_beige_0.jpg', 'FP2_80300002_beige_1.jpg', 'FP2_80300002_beige_2.jpg', '', '699', 0, 'FP2_80300002', '2022-06-16 00:20:58', '2022-06-15 23:44:07', '3.69'),
(51, '編織涼鞋', '鞋', 'Female', '編織草編拖鞋，露趾和交叉腳帶。人造皮革鞋墊和凹槽鞋底。鞋底厚度1.9公分', '<br>鞋墊: 仿皮 100%\r\n<br>內裡: 聚丙烯 100%\r\n<br>鞋底: 熱塑性橡膠 100%\r\n<br>鞋幫: 聚丙烯 100%', 'FP2_80300003_beige_0.jpg', 'FP2_80300003_beige_1.jpg', 'FP2_80300003_beige_2.jpg', 'FP2_80300003_beige_3.jpg', '999', 0, 'FP2_80300003', '2022-06-16 00:22:09', '2022-06-15 23:49:32', '3.26'),
(52, '紋理感戲水鞋', '鞋', 'Female', '塑膠戲水鞋，鞋面有紋理感飾帶，壓模花紋鞋底有溝槽設計。鞋底高4公分。', '<br>外層: 乙烯-醋酸乙烯酯共聚物 100%\r\n<br>內裡: 乙烯-醋酸乙烯酯共聚物 100%\r\n<br>鞋底: 乙烯-醋酸乙烯酯共聚物 100%\r\n<br>鞋墊: 乙烯-醋酸乙烯酯共聚物 100%', 'FP2_80300004_beige_0.jpg', 'FP2_80300004_beige_1.jpg', 'FP2_80300004_beige_2.jpg', 'FP2_80300004_beige_3.jpg', '499', 0, 'FP2_80300004', '2022-06-16 00:22:46', '2022-06-15 23:54:44', '3.98'),
(53, '草帽', '帽子', 'Female', '柔軟紙編草帽，有吸汗帶。', '紙 100%', 'FP2_80500001_beige_0.jpg', 'FP2_80500001_beige_1.jpg', '', '', '399', 0, 'FP2_80500001', '2022-06-16 00:33:44', '2022-06-16 00:24:20', '4.88'),
(54, '草帽', '帽子', 'Female', '紙編草帽，帽頂呈凹形，配寬羅緞飾帶。帽簷寬6.5公分。', '紙籐 100%', 'FP2_80500002_beige_0.jpg', 'FP2_80500002_beige_1.jpg', '', '', '399', 0, 'FP2_80500002', '2022-06-16 00:33:19', '2022-06-16 00:33:19', '4.93'),
(58, '棉質漁夫帽', '帽子', 'Female', '棉質平織漁夫帽，有吸汗帶。', '內裡: 聚酯纖維 100%外層: 棉 100%', 'hmgoepprod.jpg', 'hmgoepprod (1).jpg', 'hmgoepprod (2).jpg', '', '499', NULL, 'FP2_80500003', '2022-07-11 14:20:23', '2022-07-09 03:38:13', '4.71'),
(61, '休閒剪裁毛巾布襯衫', '上衣', 'Male', '柔軟毛巾布短袖襯衫，休閒領，法式前襟設計，背面有肩襠，休閒剪裁。有開口式單胸袋，直身下襬，兩側開衩。', '棉 74%, 聚酯纖維 26%', 'hmgoepprod (11).jpg', 'hmgoepprod (10).jpg', 'hmgoepprod (9).jpg', '', '799', NULL, 'FP1_80100011', '2022-07-11 14:29:37', '2022-07-09 04:05:37', '4.11'),
(62, '休閒棉質T恤', '上衣', 'Male', '柔軟棉質平紋T恤，細羅紋圓領，休閒剪裁，垂肩設計，直身下襬。', '棉 100%', 'hmgoepprod (12).jpg', 'hmgoepprod (13).jpg', 'hmgoepprod (14).jpg', '', '599', NULL, 'FP1_80100012', '2022-07-12 02:23:10', '2022-07-09 04:21:23', '3.65'),
(63, '印花棉質斜紋漁夫帽', '帽子', 'Female', '印花棉質斜紋漁夫帽，一側有字樣小貼花，兩側有刺繡孔眼。府綢棉吸汗帶。帽簷寬7.5公分。', '內裡: 棉 100%外層: 棉 100%', 'hmgoepprod (15).jpg', 'hmgoepprod (16).jpg', 'hmgoepprod (17).jpg', '', '499', NULL, 'FP2_80500004', '2022-07-11 15:04:07', '2022-07-09 04:24:48', '3.99'),
(73, '襯衫配短褲睡衣套裝', '上衣', 'Male', '透氣棉質平織睡衣套裝，含短袖襯衫和短褲。襯衫，翻領，正面鈕扣開襟，有開口式單胸袋；短褲，覆面鬆緊帶腰圍配抽繩，假門襟，側縫處有口袋。            ', '棉 100%                          ', 'hmgoepprod (33).jpg', 'hmgoepprod (34).jpg', 'hmgoepprod (35).jpg', '', '699', NULL, 'FP1_80100013', '2022-07-11 15:15:15', '2022-07-10 14:28:28', '4.04'),
(74, '極黑涼鞋', '鞋', 'Male', '鞋面有鋪棉交叉飾帶，鋪棉後跟帶有可調式魔鬼粘扣帶。真皮內裡和內底。鞋底高3公分。                     ', '外層: 皮革 100%鞋底: 乙烯-醋酸乙烯酯共聚物 100%內裡和襪子: 皮革 100%\r\n                                            ', 'hmgoepprod (30).jpg', 'hmgoepprod (31).jpg', 'hmgoepprod (32).jpg', '', '699', NULL, 'FP1_80300006', '2022-07-11 15:19:16', '2022-07-10 14:32:09', '3.50'),
(103, '休閒圖案運動衫smy', '上衣', 'Male', '輕薄棉質汗衫布料上衣，正面印圖案，休閒剪裁，垂肩長袖，羅紋圓領、袖口和下襬。                                            ', '棉 100%                                            ', 'hmgoepprod (36).jpg', 'hmgoepprod (37).jpg', 'hmgoepprod (38).jpg', '', '799', NULL, 'FP1_80319699', '2022-07-12 05:29:45', '2022-07-12 03:22:16', ''),
(104, '德比鞋', '鞋', 'Male', '圓頭德比鞋，開放式鞋翼，棉質帆布內裡和內底，平滑鞋底。跟高2.4公分。', '內裡和襪子: 棉 100%鞋幫: 聚氨酯 100%鞋底: 熱塑性橡膠 100%                                            ', 'hmgoepprod (39).jpg', 'hmgoepprod (40).jpg', 'hmgoepprod (41).jpg', '', '1499', NULL, 'FP1_80307722', '2022-07-12 05:47:26', '2022-07-12 05:47:26', ''),
(105, '貼身牛仔褲', '下著', 'Male', '5袋式彈性棉質丹寧牛仔褲，中腰剪裁，拉鍊門襟配鈕扣，貼身褲管。                                            ', '口袋內裡: 棉 100%外層: 棉 99%, 彈性纖維 1%                                            ', 'hmgoepprod (42).jpg', 'hmgoepprod (43).jpg', 'hmgoepprod (44).jpg', '', '1000', NULL, 'FP1_80374522', '2022-07-12 08:13:19', '2022-07-12 05:56:03', ''),
(106, '棉質洋裝', '上衣', 'Female', '透氣棉質平織睡衣套裝               ', '123                                            ', 'hmgoepprod (18).jpg', 'hmgoepprod (19).jpg', 'hmgoepprod (20).jpg', '', '999', NULL, 'FP1_80300059', '2022-07-12 09:59:24', '2022-07-12 08:14:13', ''),
(107, '加大碼休閒襯衫', '上衣', 'Female', '短版加大碼襯衫，嫘縈平織布料，帶柔軟垂墜感，休閒領，正面鈕扣開襟，垂肩寬鬆五分袖。無內裡。                                            ', '嫘縈 100%\r\n                                            ', 'hmgoepprod (45).jpg', 'hmgoepprod (46).jpg', 'hmgoepprod (47).jpg', '', '500', NULL, 'FP2_80500778', '2022-07-12 08:23:56', '2022-07-12 08:23:48', '');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `products`
--
ALTER TABLE `products`
  ADD PRIMARY KEY (`product_id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `products`
--
ALTER TABLE `products`
  MODIFY `product_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=109;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
